<a href="https://colab.research.google.com/github/Vitorg-ux/Project2020/blob/main/Untitled0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Università degli studi di Milano-Bicocca
# Laurea Magistrale in Data Science
# Foundations of Computer Science (2021-1-F9101Q001)

[University dataset](https://drive.google.com/drive/folders/1Hs3nRtK_F3h8eg59B4-TD1DEua6g8Klv)

Importazione delle librerie.

In [20]:
import pandas as pd
import re
import numpy as np

Importazione del dataset "timesData.csv", specificando che la virgola viene utilizzata come separatore per le migliaia, in modo che i dati contenuti nella colonna "num_students" vengano letti correttamente.

In [21]:
times = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/timesData.csv', thousands = ',', na_values = '-')
times.head()

  world_rank                        university_name  ... female_male_ratio  year
0          1                     Harvard University  ...               NaN  2011
1          2     California Institute of Technology  ...           33 : 67  2011
2          3  Massachusetts Institute of Technology  ...           37 : 63  2011
3          4                    Stanford University  ...           42 : 58  2011
4          5                   Princeton University  ...           45 : 55  2011

[5 rows x 14 columns]

Importazione del dataset "ShanghaiData.csv".

In [22]:
shanghai = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/shanghaiData.csv')
shanghai.head()

  world_rank                              university_name  ...   pcp  year
0          1                           Harvard University  ...  72.4  2005
1          2                      University of Cambridge  ...  66.9  2005
2          3                          Stanford University  ...  65.0  2005
3          4           University of California, Berkeley  ...  52.7  2005
4          5  Massachusetts Institute of Technology (MIT)  ...  53.0  2005

[5 rows x 11 columns]

Importazione del dataset "cwurData.csv".

In [23]:
cwur = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/cwurData.csv')
cwur.head()

   world_rank                            institution  ...   score  year
0           1                     Harvard University  ...  100.00  2012
1           2  Massachusetts Institute of Technology  ...   91.67  2012
2           3                    Stanford University  ...   89.50  2012
3           4                University of Cambridge  ...   86.17  2012
4           5     California Institute of Technology  ...   85.21  2012

[5 rows x 14 columns]

## 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes

Creazione del dataframe "times_most_recent", contenente i dati più recenti (ossia associati al massimo valore possibile nella colonna "year") relativi a ciascuna università presente nel dataframe "times".

In [24]:
times_most_recent = times.loc[times.groupby('university_name')['year'].idxmax()]
times_most_recent.head()

     world_rank  ...  year
2405    601-800  ...  2016
2003    201-250  ...  2016
2056    251-300  ...  2016
1908       =106  ...  2016
2105    301-350  ...  2016

[5 rows x 14 columns]

Creazione del dataframe "times_least_recent", contenente i dati meno recenti (ossia associati al minimo valore possibile nella colonna "year") relativi a ciascuna università presente nel dataframe "times".

In [25]:
times_least_recent = times.iloc[times.groupby('university_name')['year'].idxmin()]
times_least_recent.head()

     world_rank  ...  year
2405    601-800  ...  2016
501     301-350  ...  2012
502     301-350  ...  2012
166         167  ...  2011
476     276-300  ...  2012

[5 rows x 14 columns]

## 2. For each university, compute the improvement in income between the least recent and the most recent data points

Creazione del dataframe "times_least_most_recent" effettuando un join dei dataframe "times_least_recent" e "times_most_recent".

In [26]:
times_least_most_recent = pd.merge(times_least_recent[['university_name', 'year', 'income']], times_most_recent[['university_name', 'year', 'income']], on = ['university_name'], suffixes = ('_least_recent', '_most_recent'))
times_least_most_recent.head()

                            university_name  ...  income_most_recent
0  AGH University of Science and Technology  ...                 NaN
1                        Aalborg University  ...                43.7
2                          Aalto University  ...                61.6
3                         Aarhus University  ...                68.3
4                    Aberystwyth University  ...                31.3

[5 rows x 5 columns]

Calcolo del miglioramento di reddito ("income_most_recent" - "income_least_recent") tra i dati più recenti e quelli meno recenti per ciascuna università.

In [27]:
times_least_most_recent['improvement'] = pd.to_numeric(times_least_most_recent['income_most_recent']) - pd.to_numeric(times_least_most_recent['income_least_recent'])
times_least_most_recent.head()

                            university_name  ...  improvement
0  AGH University of Science and Technology  ...          NaN
1                        Aalborg University  ...          7.3
2                          Aalto University  ...         -0.3
3                         Aarhus University  ...          6.8
4                    Aberystwyth University  ...         -4.2

[5 rows x 6 columns]

### 3. Find the university with the largest increase computed in the previous point

In [29]:
times_least_most_recent[times_least_most_recent['improvement'] >= times_least_most_recent['improvement'].max()]

    university_name  year_least_recent  ...  income_most_recent  improvement
428      TU Dresden               2012  ...                99.7         67.8

[1 rows x 6 columns]

## 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

Creazione del dataframe "shanghai_most_recent", contenente i dati più recenti (ossia associati al massimo valore possibile nella colonna "year") relativi a ciascuna università presente nel dataframe "shanghai".

In [32]:
shanghai_most_recent = shanghai.iloc[shanghai.groupby('university_name').idxmax()['year']]
shanghai_most_recent.head()

     world_rank           university_name national_rank  ...   pub   pcp  year
4697    301-400        Aalborg University             5  ...  30.4  16.8  2015
4797    401-500          Aalto University           4-6  ...  33.4  17.0  2015
4469         73         Aarhus University             2  ...  51.8  31.0  2015
4497    101-150  Aix Marseille University           5-6  ...  50.1  27.6  2015
3115    102-150  Aix-Marseille University           4-6  ...  44.3  15.3  2011

[5 rows x 11 columns]

Ridenominazione della colonna "institution" del dataframe "cwur" in "university_name".

In [33]:
cwur.rename(columns = {'institution' : 'university_name'}, inplace = True)

Creazione del dataframe "cwur_most_recent", contenente i dati più recenti (ossia associati al massimo valore possibile nella colonna "year") relativi a ciascuna università presente nel dataframe "cwur".

In [34]:
cwur_most_recent = cwur.iloc[cwur.groupby('university_name').idxmax()['year']]
cwur_most_recent.head()

      world_rank                           university_name  ...  score  year
1981         782  AGH University of Science and Technology  ...  44.26  2015
1764         565                        Aalborg University  ...  44.59  2015
1620         421                          Aalto University  ...  45.10  2015
1321         122                         Aarhus University  ...  49.65  2015
2013         814                    Aberystwyth University  ...  44.22  2015

[5 rows x 14 columns]

Creazione del dataframe "most_recent_ranking", costruito effettuando il join dei dataframe "times_most_recent", "shanghai_most_recent" e "cwur_most_recent".

In [35]:
most_recent_ranking = pd.merge(times_most_recent[['university_name', 'world_rank']], shanghai_most_recent[['university_name', 'world_rank']], on = ['university_name'], suffixes = ('_times', '_shanghai'))
most_recent_ranking = pd.merge(most_recent_ranking, cwur_most_recent[['university_name', 'world_rank']], on = ['university_name'])
most_recent_ranking.rename(columns = {'world_rank' : 'world_rank_cwur'}, inplace = True)
most_recent_ranking.head()

                        university_name  ... world_rank_cwur
0                    Aalborg University  ...             565
1                      Aalto University  ...             421
2                     Aarhus University  ...             122
3              Aix-Marseille University  ...             206
4  Aristotle University of Thessaloniki  ...             459

[5 rows x 4 columns]

In [89]:
interval = times_most_recent['world_rank'].str.extract('(\d+)\-?(\d*)')
interval[0] = pd.to_numeric(interval[0])
interval[1] = pd.to_numeric(interval[1])
interval['rank'] = np.nanmean(interval, axis = 1).round()
interval

        0      1   rank
2405  601  800.0  700.0
2003  201  250.0  226.0
2056  251  300.0  276.0
1908  106    NaN  106.0
2105  301  350.0  326.0
...   ...    ...    ...
1856   54    NaN   54.0
2013  201  250.0  226.0
1904  101    NaN  101.0
1833   31    NaN   31.0
2134  301  350.0  326.0

[818 rows x 3 columns]

In [37]:
times_most_recent['avg_rank'] = round((pd.to_numeric(times_most_recent['world_rank'].str.extract('^(\d+)\-(\d+)')[0]) + pd.to_numeric(times_most_recent['world_rank'].str.extract('^(\d+)\-(\d+)')[1])) / 2)
times_most_recent.head()

     world_rank                           university_name  ...  year  avg_rank
2405    601-800  AGH University of Science and Technology  ...  2016     700.0
2003    201-250                        Aalborg University  ...  2016     226.0
2056    251-300                          Aalto University  ...  2016     276.0
1908       =106                         Aarhus University  ...  2016       NaN
2105    301-350                    Aberystwyth University  ...  2016     326.0

[5 rows x 15 columns]

__DA FINIRE__

### 5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country

Creazione del dataframe "times_most_recent_f_m" a partire dalle colonne "university_name", "country", "num_students" e "female_male_ratio" del dataframe "times_most_recent".

In [ ]:
times_most_recent_f_m = times_most_recent[['university_name', 'country', 'num_students', 'female_male_ratio']].copy()
times_most_recent_f_m.head()

Creazione della colonna "females_percentage", contenente la percentuale di femmine per ciascuna università.

In [ ]:
times_most_recent_f_m['females_percentage'] = times_most_recent_f_m['female_male_ratio'].str.extract('^(\d+)')
times_most_recent_f_m['females_percentage'] = pd.to_numeric(times_most_recent_f_m['females_percentage']) / 100
times_most_recent_f_m.head()

Creazione della colonna "males_percentage", contenente la percentuale di maschi per ciascuna università.

In [ ]:
times_most_recent_f_m['males_percentage'] = times_most_recent_f_m['female_male_ratio'].str.extract('(\d+)$')
times_most_recent_f_m['males_percentage'] = pd.to_numeric(times_most_recent_f_m['males_percentage']) / 100
times_most_recent_f_m.head()

Eliminazione delle righe che contengono valori nulli in corrispondenza delle colonne "females_percentage" e "males_percentage".

In [ ]:
times_most_recent_f_m.dropna(subset = ['females_percentage', 'males_percentage'], inplace = True)
times_most_recent_f_m.head()

Creazione delle colonne "females" e "males", contenenti, rispettivamente, il numero di studentesse e quello di studenti.

In [ ]:
times_most_recent_f_m['females'] = times_most_recent_f_m['num_students'] * times_most_recent_f_m['females_percentage']
times_most_recent_f_m['males'] = times_most_recent_f_m['num_students'] * times_most_recent_f_m['males_percentage']
times_most_recent_f_m.head()

Calcolo del numero totale di studentesse e di quello di studenti per ciascun paese.

In [ ]:
times_most_recent_f_m.groupby('country', as_index = False).sum().round()[['country', 'females', 'males']]

## 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

Creazione della colonna "ratio", contenente il rapporto tra femmine e maschi per ciascuna università.

In [ ]:
times_most_recent_f_m['ratio'] = times_most_recent_f_m['females_percentage'] / times_most_recent_f_m['males_percentage']
times_most_recent_f_m.head()

Calcolo del rapporto medio tra femmine e maschi su tutte le università.

In [ ]:
avg_ratio = times_most_recent_f_m[times_most_recent_f_m['males_percentage'] != 0].mean()['ratio']
avg_ratio

Estrazione delle università caratterizzate da un rapporto tra femmine e maschi minore di quello medio.

In [ ]:
below_avg_f_m_ratio = times_most_recent_f_m[times_most_recent_f_m['ratio'] < avg_ratio]
below_avg_f_m_ratio.head()

### 7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country)

Creazione del dataframe "total_students_in_country", contenente il numero totale di studenti per ogni paese.

In [ ]:
total_students_in_country = times_most_recent.groupby('country', as_index = False).sum()[['country', 'num_students']]
total_students_in_country.rename(columns = {'num_students' : 'total_students'}, inplace = True)
total_students_in_country.head()

Creazione del dataframe "students_in_country_below_avg" che, per ciascun paese, indica il numero di studenti che frequentano un'università caratterizzata da un rapporto tra femmine e maschi minore di quello medio.

In [ ]:
students_in_country_below_avg = below_avg_f_m_ratio.groupby('country', as_index = False).sum()[['country', 'num_students']]
students_in_country_below_avg.head()

Creazione del dataframe "students_in_country", che costituisce il join dei dataframe "students_in_country_below_avg" e "total_students_in_country".

In [ ]:
students_in_country = pd.merge(students_in_country_below_avg, total_students_in_country, on = ['country'])
students_in_country.head()

Calcolo del rapporto tra il numero di studenti che frequentano un'università caratterizzata da un rapporto tra femmine e maschi minore di quello medio e il numero di studenti totali per ciascun paese.

In [ ]:
students_in_country['ratio'] = students_in_country['num_students'] / students_in_country['total_students']
students_in_country.head()

### 8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name

In [ ]:
attainment = pd.read_csv('/content/drive/MyDrive/Colab Notebooks/educational_attainment_supplementary_data.csv')
attainment.dropna(subset = ['country_name', 'series_name'], inplace = True)
attainment.head()

In [ ]:
attainment[attainment['country_name'].isnull()]

In [ ]:
attainment[attainment['series_name'].isnull()]

### 9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value

In [ ]:
unpivoted_attainment = pd.melt(attainment, id_vars=['country_name', 'series_name'], var_name = 'year')
unpivoted_attainment

### 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking)

Creazione della lista "rankings", contenente tutti i dataframe associati alle diverse tipologie di ranking; ciascuna università compare al più una volta in ciascun ranking.

In [ ]:
rankings = [times['university_name'].unique(), shanghai['university_name'].unique(), cwur['university_name'].unique()]

Costruzione del dizionario "number_of_rankings" che associa a ciascuna università il numero di ranking in cui compare.

In [ ]:
number_of_rankings = {}
for ranking in rankings:
  for university in ranking:
    if university in number_of_rankings:
      number_of_rankings[university] +=1
    else:
      number_of_rankings[university] = 1
number_of_rankings

### 11. In the times ranking, compute the number of times each university appears

In [ ]:
number_times = times.groupby('university_name').size()
number_times.head()

### 12. Find the universities that appear at most twice in the times ranking¶

In [ ]:
number_times[number_times <= 2]

### 13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year)

Selezione dei dati contenuti nei dataframe "times" e "shanghai" in cui l'espressione della posizione nel ranking non è espressa mediante un intervallo.

In [ ]:
times_no_intervals = times[~ times['world_rank'].str.contains('-')].copy()
times_no_intervals.tail()

In [ ]:
shanghai_no_intervals = shanghai[~ shanghai['world_rank'].str.contains('-')].copy()
shanghai_no_intervals.head()

Correzione dei valori di posizione nel ranking preceduti dal simbolo "=" contenuti nel dataframe "times_no_intervals".

In [ ]:
times_no_intervals['world_rank'] = times_no_intervals['world_rank'].str.extract('(\d+)$')
times_no_intervals.tail()

Join dei dataframe "times_no_intervals",  "shanghai_no_intervals" e "cwur".

In [ ]:
same_year_same_rank = pd.merge(times_no_intervals[['university_name', 'year', 'world_rank']], shanghai_no_intervals[['university_name', 'year', 'world_rank']], on = ['university_name', 'year'], suffixes = ('_times', '_shanghai'))
same_year_same_rank = pd.merge(same_year_same_rank, cwur[['university_name', 'year', 'world_rank']], on = ['university_name', 'year'])
same_year_same_rank.rename(columns = {'world_rank' : 'world_rank_cwur'}, inplace = True)
same_year_same_rank.head()

In [ ]:
same_year_same_rank[(pd.to_numeric(same_year_same_rank['world_rank_times']) == same_year_same_rank['world_rank_cwur'])
& (pd.to_numeric(same_year_same_rank['world_rank_shanghai']) == same_year_same_rank['world_rank_cwur'])]